#### Environment - `dev`
#### Terraform Format and Style - `success`
#### Terraform Initialization - `success`
#### Terraform Validation - `success`
#### Terraform Plan - `success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
envs/dev relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/conf-infra/conf-infra/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/conf-infra/conf-infra

To view this run in a browser, visit:
https://app.terraform.io/app/serhiimakogon/clarks-dev/runs/run-x4kTbywoGBD9KNHH

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
confluent_environment.dev: Refreshing state... [id=env-0x1kg6]
module.governance_cluster.data.confluent_stream_governance_region.essentials: Reading...
module.governance_cluster.data.confluent_stream_governance_region.essentials: Read complete after 0s [id=sgreg-1]
module.governance_cluster.confluent_stream_governance_cluster.essentials: Refreshing state... [id=lsrc-7yw23w]
module.kafka_cluster.random_id.cluster_suffix: Refreshing state... [id=CY4zCw]
module.kafka_cluster.confluent_kafka_cluster.basic: Refreshing state... [id=lkc-389xv2]
module.ksql_cluster.confluent_service_account.ksql: Refreshing state... [id=sa-8mg3qq]
module.ksql_cluster.random_id.cluster_suffix: Refreshing state... [id=gK6BEg]
module.ksql_cluster.confluent_role_binding.ksql_kafka_cluster_admin: Refreshing state... [id=rb-yAW4B]
module.ksql_cluster.confluent_ksql_cluster.ksql: Refreshing state... [id=lksqlc-q2k0op]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ksql_cluster.confluent_ksql_cluster.ksql must be replaced
-/+ resource "confluent_ksql_cluster" "ksql" {
      ~ api_version                 = "ksqldbcm/v2" -> (known after apply)
      ~ http_endpoint               = "https://pksqlc-q6qk2.us-east-2.aws.confluent.cloud:443" -> (known after apply)
      ~ id                          = "lksqlc-q2k0op" -> (known after apply)
      ~ kind                        = "Cluster" -> (known after apply)
      ~ storage                     = 125 -> (known after apply)
      ~ topic_prefix                = "pksqlc-q6qk2" -> (known after apply)
        # (3 unchanged attributes hidden)

      ~ credential_identity {
          ~ id = "sa-8mg3qq" -> (known after apply) # forces replacement
        }

        # (2 unchanged blocks hidden)
    }

  # module.ksql_cluster.confluent_role_binding.ksql_kafka_cluster_admin must be replaced
-/+ resource "confluent_role_binding" "ksql_kafka_cluster_admin" {
      ~ id          = "rb-yAW4B" -> (known after apply)
      ~ principal   = "User:sa-8mg3qq" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.ksql_cluster.confluent_service_account.ksql must be replaced
-/+ resource "confluent_service_account" "ksql" {
      ~ api_version  = "iam/v2" -> (known after apply)
      ~ display_name = "ksql" -> "dev_ksql" # forces replacement
      ~ id           = "sa-8mg3qq" -> (known after apply)
      ~ kind         = "ServiceAccount" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.


```

</details>

*Pushed by: @serhiimakogon, Action: `pull_request`*